apache/nuttx/arch/xtensa/src/esp32/esp32_ble_adapter.c
SOC_RESERVE_MEMORY_REGION(SOC_MEM_BT_EM_START,
                          SOC_MEM_BT_EM_BREDR_REAL_END,
                          rom_bt_em);
SOC_RESERVE_MEMORY_REGION(SOC_MEM_BT_BSS_START,
                          SOC_MEM_BT_BSS_END,
                          rom_bt_bss);
SOC_RESERVE_MEMORY_REGION(SOC_MEM_BT_MISC_START,
                          SOC_MEM_BT_MISC_END,
                          rom_bt_misc);
SOC_RESERVE_MEMORY_REGION(SOC_MEM_BT_DATA_START,
                          SOC_MEM_BT_DATA_END,
                          rom_bt_data);

static DRAM_ATTR struct osi_funcs_s *g_osi_funcs_p;

/* timestamp when PHY/RF was switched on */

static DRAM_ATTR int64_t g_time_phy_rf_just_enabled = 0;

static DRAM_ATTR esp_bt_controller_status_t g_btdm_controller_status =
    ESP_BT_CONTROLLER_STATUS_IDLE;

/* measured average low power clock period in micro seconds */

static DRAM_ATTR uint32_t g_btdm_lpcycle_us = 0;

/* number of fractional bit for g_btdm_lpcycle_us */

static DRAM_ATTR uint8_t g_btdm_lpcycle_us_frac = 0;

#ifdef CONFIG_BTDM_CTRL_MODEM_SLEEP_MODE_ORIG

/* used low power clock */

static DRAM_ATTR uint8_t g_btdm_lpclk_sel;

#endif /* CONFIG_BTDM_CTRL_MODEM_SLEEP_MODE_ORIG */

/* semaphore used for blocking VHCI API to wait for controller to wake up */

static DRAM_ATTR struct bt_sem_s * g_wakeup_req_sem = NULL;

#ifdef CONFIG_PM

/* wakeup timer */

static DRAM_ATTR esp_timer_handle_t g_btdm_slp_tmr;

static bool g_pm_lock_acquired = true;

static DRAM_ATTR bool g_btdm_allow_light_sleep;

#endif

/* BT interrupt private data */

irqstate_t g_ble_int_flags;

static int g_ble_int_count = 0;

/* Cached queue control variables */

#ifdef CONFIG_ESPRESSIF_SPIFLASH
static struct esp_queuecache_s g_esp_queuecache[BLE_TASK_EVENT_QUEUE_LEN];
static uint8_t g_esp_queuecache_buffer[BLE_TASK_EVENT_QUEUE_ITEM_SIZE];
#endif

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Inline Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_errno_trans
 *
 * Description:
 *   Transform NuttX error code to a boolean value. Returns true if the
 *   input error code is 0 (no error), and false otherwise.
 *
 * Input Parameters:
 *   ret - NuttX error code
 *
 * Returned Value:
 *   Boolean value indicating the absence (true) or presence (false) of an
 *   error
 *
 ****************************************************************************/

static inline int32_t esp_errno_trans(int ret)
{
  if (!ret)
    {
      return true;
    }
  else
    {
      return false;
    }
}

/****************************************************************************
 * Name: esp_bt_power_domain_on
 *
 * Description:
 *   Power up the Bluetooth module. This function is a wrapper for the
 *   esp_wifi_bt_power_domain_on function.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void esp_bt_power_domain_on(void)
{
  esp_wifi_bt_power_domain_on();
}

/****************************************************************************
 * Name: esp_bt_power_domain_off
 *
 * Description:
 *   Power down the Bluetooth module. This function is a wrapper for the
 *   esp_wifi_bt_power_domain_off function.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void esp_bt_power_domain_off(void)
{
  esp_wifi_bt_power_domain_off();
}

/****************************************************************************
 * Name: btdm_check_and_init_bb
 *
 * Description:
 *   Check and initialize the Bluetooth baseband (BB). If the PHY/RF has
 *   been switched off since the last Bluetooth baseband initialization, it
 *   re-initializes the baseband.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void btdm_check_and_init_bb(void)
{
  int64_t latest_ts = esp_phy_rf_get_on_ts();

  if (latest_ts != g_time_phy_rf_just_enabled ||
      g_time_phy_rf_just_enabled == 0)
    {
      btdm_rf_bb_init_phase2();
      g_time_phy_rf_just_enabled = latest_ts;
    }
}

/****************************************************************************
 * Functions to be registered to struct osi_funcs_s
 ****************************************************************************/

/****************************************************************************
 * Name: ble_set_isr
 *
 * Description:
 *   Register interrupt function
 *
 * Input Parameters:
 *   n   - CPU Interrupt ID
 *   f   - Interrupt function
 *   arg - Function private data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static xt_handler ble_set_isr(int n, xt_handler f, void *arg)
{
  int ret;
  intr_handle_t handle;
  int irq;

  switch (n)
    {
      case 5:
        {
          irq = ESP_SOURCE2IRQ(ETS_RWBT_INTR_SOURCE);
        }
        break;

      case 7:
        {
          irq = ETS_INTERNAL_SW0_INTR_SOURCE + \
                ETS_INTERNAL_INTR_SOURCE_OFF;
        }
        break;

      case 8:
        {
          irq = ESP_SOURCE2IRQ(ETS_BT_BB_INTR_SOURCE);
        }
        break;

      default:
        {
          wlerr("ERROR: Invalid interrupt number %d\n", n);
          return NULL;
        }
    }

  wlinfo("n=%d f=%p arg=%p irq=%d\n", n, f, arg, irq);

  handle = kmm_calloc(1, sizeof(intr_handle_data_t));
  if (handle == NULL)
    {
      wlerr("Failed to kmm_calloc\n");
      return NULL;
    }

  handle->vector_desc = get_desc_for_int(n, this_cpu());

  /* Register the handle - it contains all needed information (cpuint, cpu) */

  esp_set_handle(this_cpu(), irq, handle);

