apache/nuttx/arch/xtensa/src/esp32/esp32_ble_adapter.c
  uint64_t cycles;
  cycles = ((uint64_t)(us) << g_btdm_lpcycle_us_frac) / g_btdm_lpcycle_us;
  return (uint32_t)cycles;
}

/****************************************************************************
 * Name: btdm_sleep_check_duration
 *
 * Description:
 *   Wake up in advance considering the delay in enabling PHY/RF.
 *
 * Input Parameters:
 *   half_slot_cnt - half slots to allow to fall into modem sleep
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static bool IRAM_ATTR btdm_sleep_check_duration(uint32_t *slot_cnt)
{
  if (*slot_cnt < BTDM_MIN_SLEEP_DURATION)
    {
      return false;
    }

  *slot_cnt -= BTDM_MODEM_WAKE_UP_DELAY;
  return true;
}

/****************************************************************************
 * Name: btdm_sleep_enter_phase1_wrapper
 *
 * Description:
 *   ESP32 BLE lightsleep callback function.
 *
 * Input Parameters:
 *   lpcycles - light sleep cycles
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void btdm_sleep_enter_phase1_wrapper(uint32_t lpcycles)
{
#ifdef CONFIG_PM
  uint32_t us_to_sleep;
  uint32_t uncertainty;

  if (g_lp_cntl.wakeup_timer_required == false)
    {
      return;
    }

  /* start a timer to wake up and acquire the pm_lock before sleep awakes */

  us_to_sleep = btdm_lpcycles_2_us(lpcycles, NULL);

  DEBUGASSERT(us_to_sleep > BTDM_MIN_TIMER_UNCERTAINTY_US);
  uncertainty = (us_to_sleep >> 11);

  if (uncertainty < BTDM_MIN_TIMER_UNCERTAINTY_US)
    {
      uncertainty = BTDM_MIN_TIMER_UNCERTAINTY_US;
    }

  DEBUGASSERT(g_lp_stat.wakeup_timer_started == false);

  if (esp_timer_start_once(g_btdm_slp_tmr,
                           us_to_sleep - uncertainty) == ESP_OK)
    {
      g_lp_stat.wakeup_timer_started = true;
    }
  else
    {
      wlerr("timer start failed");
      DEBUGPANIC();
    }
#endif
}

/****************************************************************************
 * Name: btdm_sleep_enter_phase2_wrapper
 *
 * Description:
 *   ESP32 BLE lightsleep callback function.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void btdm_sleep_enter_phase2_wrapper(void)
{
  if (btdm_controller_get_sleep_mode() == BTDM_MODEM_SLEEP_MODE_ORIG)
    {
      esp_phy_disable(PHY_MODEM_BT);
#ifdef CONFIG_PM
      if (g_pm_lock_acquired)
        {
          esp32_pm_lockrelease();
          g_pm_lock_acquired = false;
        }
#endif
    }
  else if (btdm_controller_get_sleep_mode() == BTDM_MODEM_SLEEP_MODE_EVED)
    {
      esp_phy_disable(PHY_MODEM_BT);

      /* pause bluetooth baseband */

      periph_module_disable(PERIPH_BT_BASEBAND_MODULE);
    }
}

/****************************************************************************
 * Name: btdm_sleep_exit_phase3_wrapper
 *
 * Description:
 *   ESP32 BLE lightsleep callback function..
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void btdm_sleep_exit_phase3_wrapper(void)
{
#ifdef CONFIG_PM
  if (g_pm_lock_acquired == false)
    {
      g_pm_lock_acquired = true;
      esp32_pm_lockacquire();
    }
#endif

  if (btdm_controller_get_sleep_mode() == BTDM_MODEM_SLEEP_MODE_ORIG)
    {
      esp_phy_enable(PHY_MODEM_BT);
      btdm_check_and_init_bb();
#ifdef CONFIG_PM
      esp_timer_stop(g_btdm_slp_tmr);
#endif
    }
  else if (btdm_controller_get_sleep_mode() == BTDM_MODEM_SLEEP_MODE_EVED)
    {
      /* resume bluetooth baseband */

      periph_module_enable(PERIPH_BT_BASEBAND_MODULE);
      esp_phy_enable(PHY_MODEM_BT);
    }
}

/****************************************************************************
 * Name: coex_bt_wakeup_request
 *
 * Description:
 *   Request a Wi-Fi/BLE Coex wakeup request
 *
 * Input Parameters:
 *   none
 *
 * Returned Value:
 *   true if request lock is needed, false otherwise
 *
 ****************************************************************************/

static bool coex_bt_wakeup_request(void)
{
  return async_wakeup_request(BTDM_ASYNC_WAKEUP_REQ_COEX);
}

/****************************************************************************
 * Name: coex_bt_wakeup_request_end
 *
 * Description:
 *   Finish Wi-Fi/BLE Coex wakeup request
 *
 * Input Parameters:
 *   none
 *
 * Returned Value:
 *   none
 *
 ****************************************************************************/

static void coex_bt_wakeup_request_end(void)
{
  async_wakeup_request_end(BTDM_ASYNC_WAKEUP_REQ_COEX);
}

/****************************************************************************
 * Name: coex_bt_request_wrapper
 *
 * Description:
 *   Bluetooth requests coexistence.
 *
 * Input Parameters:
 *   event    - Bluetooth event
 *   latency  - Bluetooth will request coexistence after latency
 *   duration - duration for Bluetooth to request coexistence
 *
 * Returned Value:
 *   0 on success, other values indicate failure
 *
 ****************************************************************************/

static int IRAM_ATTR coex_bt_request_wrapper(uint32_t event,
                                             uint32_t latency,
                                             uint32_t duration)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_bt_request(event, latency, duration);
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_bt_release_wrapper
 *
 * Description:
 *   Bluetooth releases coexistence.
 *
 * Input Parameters:
 *   event - Bluetooth event
 *
 * Returned Value:
 *   0 on success, other values indicate failure
 *
 ****************************************************************************/

static int IRAM_ATTR coex_bt_release_wrapper(uint32_t event)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_bt_release(event);
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: adapter_coex_register_bt_cb_wrapper
 *
 * Description:
 *   Bluetooth registers callback function to coexistence module.
 *   This function is only used on ESP32.
 *
 * Input Parameters:
 *   cb - callback function registered to coexistence module
 *
 * Returned Value:
 *   0 on success, other values indicate failure
 *
 ****************************************************************************/

static int adapter_coex_register_bt_cb_wrapper(coex_func_cb_t cb)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_register_bt_cb(cb);
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_bb_reset_lock_wrapper
 *
 * Description:
 *   To acquire the spin-lock used in resetting Bluetooth baseband.
 *   This function is only used to workaround ESP32 hardware issue.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Value of the spinlock to be restored
 *
 ****************************************************************************/

static uint32_t IRAM_ATTR coex_bb_reset_lock_wrapper(void)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_bb_reset_lock();
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_bb_reset_unlock_wrapper
 *
 * Description:
 *   To release the spin-lock used in resetting Bluetooth baseband.
 *   This function is only used to workaround ESP32 hardware issue.
 *
 * Input Parameters:
 *   restore - value of the spinlock returned from previous call of
 *             coex_bb_rest_lock
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR coex_bb_reset_unlock_wrapper(uint32_t restore)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  coex_bb_reset_unlock(restore);
#endif
}

/****************************************************************************
 * Name: coex_schm_register_btdm_callback_wrapper
 *
 * Description:
 *   Register callback for coexistence scheme.
 *
 * Input Parameters:
 *   callback - callback function to be registered
 *
 * Returned Value:
 *   0 on success, other values indicate failure
 *
 ****************************************************************************/

static int coex_schm_register_btdm_callback_wrapper(void *callback)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_schm_register_callback(COEX_SCHM_CALLBACK_TYPE_BT, callback);
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_schm_status_bit_clear_wrapper
 *
 * Description:
 *   Clear coexistence status.
 *
 * Input Parameters:
 *   type - Coexistence status type
 *   status - Coexistence status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void coex_schm_status_bit_clear_wrapper(uint32_t type,
                                               uint32_t status)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  coex_schm_status_bit_clear(type, status);
#endif
}

/****************************************************************************
 * Name: coex_schm_status_bit_set_wrapper
 *
 * Description:
 *   Set coexistence status.
 *
 * Input Parameters:
 *   type - Coexistence status type
 *   status - Coexistence status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

