apache/nuttx/arch/xtensa/src/esp32/esp32_ble_adapter.c
static void coex_schm_status_bit_set_wrapper(uint32_t type, uint32_t status)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  coex_schm_status_bit_set(type, status);
#endif
}

/****************************************************************************
 * Name: coex_schm_interval_get_wrapper
 *
 * Description:
 *   Get coexistence scheme interval.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Coexistence scheme interval
 *
 ****************************************************************************/

static uint32_t coex_schm_interval_get_wrapper(void)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_schm_interval_get();
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_schm_curr_period_get_wrapper
 *
 * Description:
 *   Get current coexistence scheme period.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Coexistence scheme period
 *
 ****************************************************************************/

static uint8_t coex_schm_curr_period_get_wrapper(void)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_schm_interval_get();
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_schm_curr_phase_get_wrapper
 *
 * Description:
 *   Get current coexistence scheme phase.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Coexistence scheme phase
 *
 ****************************************************************************/

static void *coex_schm_curr_phase_get_wrapper(void)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_schm_curr_phase_get();
#else
  return NULL;
#endif
}

/****************************************************************************
 * Name: coex_wifi_channel_get_wrapper
 *
 * Description:
 *   Get WiFi channel from coexistence module.
 *
 * Input Parameters:
 *   primary - pointer to value of WiFi primary channel
 *   secondary - pointer to value of WiFi secondary channel
 *
 * Returned Value:
 *   0 on success, other values indicate failure
 *
 ****************************************************************************/

static int coex_wifi_channel_get_wrapper(uint8_t *primary,
                                         uint8_t *secondary)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_wifi_channel_get(primary, secondary);
#else
  return -1;
#endif
}

/****************************************************************************
 * Name: coex_register_wifi_channel_change_callback_wrapper
 *
 * Description:
 *   Bluetooth registers callback function to receive notification when Wi-Fi
 *   channel changes.
 *
 * Input Parameters:
 *   cb - callback function registered to coexistence module
 *
 * Returned Value:
 *   0 on success, other values indicate failure
 *
 ****************************************************************************/

static int coex_register_wifi_channel_change_callback_wrapper(void *cb)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_register_wifi_channel_change_callback(cb);
#else
  return -1;
#endif
}

/****************************************************************************
 * Name: coex_version_get_wrapper
 *
 * Description:
 *   Get the version of the coexistence module.
 *
 * Input Parameters:
 *   major - pointer to store the major version number
 *   minor - pointer to store the minor version number
 *   patch - pointer to store the patch version number
 *
 * Returned Value:
 *   0 on success, -1 on failure
 *
 ****************************************************************************/

static int coex_version_get_wrapper(unsigned int *major,
                                    unsigned int *minor,
                                    unsigned int *patch)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  coex_version_t version;

  ASSERT(coex_version_get_value(&version) == ESP_OK);

  *major = (unsigned int)version.major;
  *minor = (unsigned int)version.minor;
  *patch = (unsigned int)version.patch;

  return 0;
#endif

  return -1;
}

/****************************************************************************
 * Name: patch_apply
 *
 * Description:
 *   This function resets the BTDM and BT functions based on the current
 *   configuration. If the configuration is not set to BLE only, it resets
 *   the BT functions. If the configuration is not set to BR/EDR only, it
 *   resets the BLE functions.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void patch_apply(void)
{
  config_btdm_funcs_reset();

#ifndef CONFIG_BTDM_CTRL_MODE_BLE_ONLY
  config_bt_funcs_reset();
#endif

#ifndef CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY
  config_ble_funcs_reset();
#endif
}

/****************************************************************************
 * Other functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_task_create_pinned_to_core
 *
 * Description:
 *   Create task and bind it to target CPU, the task will run when it
 *   is created
 *
 * Input Parameters:
 *   entry       - Task entry
 *   name        - Task name
 *   stack_depth - Task stack size
 *   param       - Task private data
 *   prio        - Task priority
 *   task_handle - Task handle pointer which is used to pause, resume
 *                 and delete the task
 *   core_id     - CPU which the task runs in
 *
 * Returned Value:
 *   True if success or false if fail
 *
 ****************************************************************************/

static int32_t esp_task_create_pinned_to_core(void *entry,
                                              const char *name,
                                              uint32_t stack_depth,
                                              void *param,
                                              uint32_t prio,
                                              void *task_handle,
                                              uint32_t core_id)
{
  int pid;
#ifdef CONFIG_SMP
  int ret;
  cpu_set_t cpuset;
#endif

