apache/nuttx/arch/xtensa/src/esp32/esp32_ble_adapter.c
  wlinfo(".data initialise [0x0x08%" PRIx32 "] <== [0x0x08%" PRIx32 "]\n",
         (uint32_t)_data_start_btdm, _data_start_btdm_rom);

  /* initial em, .bss section */

  btdm_dram_regions = sizeof(g_btdm_dram_available_region)
                      / sizeof(btdm_dram_available_region_t);

  for (int i = 1; i < btdm_dram_regions; i++)
    {
      if (g_btdm_dram_available_region[i].mode != ESP_BT_MODE_IDLE)
        {
          memset((void *)g_btdm_dram_available_region[i].start, 0x0,
                 g_btdm_dram_available_region[i].end - \
                 g_btdm_dram_available_region[i].start);
          wlinfo(".bss initialise [0x0x08%" PRIxPTR "] - "
                 "[0x0x08%" PRIxPTR "]\n",
                 g_btdm_dram_available_region[i].start,
                 g_btdm_dram_available_region[i].end);
        }
    }
}

/****************************************************************************
 * Name: btdm_config_mask_load
 *
 * Description:
 *   Create a mask with all ESP32 BLE supported features
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The uint32_t mask
 *
 ****************************************************************************/

static uint32_t btdm_config_mask_load(void)
{
  uint32_t mask = 0x0;

#ifdef CONFIG_UART_BTH4
  mask |= BTDM_CFG_HCI_UART;
#endif

#ifdef CONFIG_BTDM_CTRL_PINNED_TO_CORE_1
  mask |= BTDM_CFG_CONTROLLER_RUN_APP_CPU;
#endif

#ifdef CONFIG_BTDM_CTRL_FULL_SCAN_SUPPORTED
  mask |= BTDM_CFG_BLE_FULL_SCAN_SUPPORTED;
#endif

  mask |= BTDM_CFG_SCAN_DUPLICATE_OPTIONS;

  mask |= BTDM_CFG_SEND_ADV_RESERVED_SIZE;

  return mask;
}

/****************************************************************************
 * Name: bt_controller_deinit_internal
 *
 * Description:
 *   Deinitialize the internal structures of the Bluetooth controller.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void bt_controller_deinit_internal(void)
{
  periph_module_disable(PERIPH_BT_MODULE);

#ifdef CONFIG_PM

  if (g_btdm_slp_tmr != NULL)
    {
      esp_timer_stop(g_btdm_slp_tmr);
      esp_timer_delete(g_btdm_slp_tmr);
      g_btdm_slp_tmr = NULL;
    }

  g_pm_lock_acquired = false;
#endif

  if (g_wakeup_req_sem)
    {
      semphr_delete_wrapper(g_wakeup_req_sem);
      g_wakeup_req_sem = NULL;
    }

  if (g_osi_funcs_p)
    {
      free(g_osi_funcs_p);
      g_osi_funcs_p = NULL;
    }

  g_btdm_controller_status = ESP_BT_CONTROLLER_STATUS_IDLE;

  g_btdm_lpcycle_us = 0;
  btdm_controller_set_sleep_mode(BTDM_MODEM_SLEEP_MODE_NONE);

  esp_bt_power_domain_off();

  esp_phy_modem_deinit();
}

/****************************************************************************
 * Name: async_wakeup_request
 *
 * Description:
 *   Request the BLE Controller to wakeup
 *
 * Input Parameters:
 *   event - the event that triggered the wakeup
 *
 * Returned Value:
 *   true if request lock is needed, false otherwise
 *
 ****************************************************************************/

static bool async_wakeup_request(int event)
{
  bool request_lock = false;
  bool do_wakeup_request = false;

  switch (event)
    {
      case BTDM_ASYNC_WAKEUP_REQ_HCI:
        btdm_in_wakeup_requesting_set(true);

        /* No break */

      case BTDM_ASYNC_WAKEUP_REQ_CTRL_DISA:
        if (!btdm_power_state_active())
          {
            do_wakeup_request = true;

            btdm_dispatch_work_to_controller(btdm_wakeup_request_callback,
                                             NULL,
                                             true);
            semphr_take_wrapper(g_wakeup_req_sem, OSI_FUNCS_TIME_BLOCKING);
          }
        break;
      case BTDM_ASYNC_WAKEUP_REQ_COEX:
        if (!btdm_power_state_active())
          {
            do_wakeup_request = true;
#if CONFIG_PM
            if (g_pm_lock_acquired == false)
              {
                g_pm_lock_acquired = true;
                esp32_pm_lockacquire();
              }

            esp_timer_stop(g_btdm_slp_tmr);
#endif
            btdm_wakeup_request();
          }
        break;
      default:
        return false;
    }

  return do_wakeup_request;
}

/****************************************************************************
 * Name: async_wakeup_request_end
 *
 * Description:
 *   Finish a wakeup request
 *
 * Input Parameters:
 *   event - the event that triggered the wakeup
 *
 * Returned Value:
 *   true if request lock is needed, false otherwise
 *
 ****************************************************************************/

static void async_wakeup_request_end(int event)
{
  bool request_lock = false;

  switch (event)
    {
      case BTDM_ASYNC_WAKEUP_REQ_HCI:
        request_lock = true;
        break;
      case BTDM_ASYNC_WAKEUP_REQ_COEX:
      case BTDM_ASYNC_WAKEUP_REQ_CTRL_DISA:
        request_lock = false;
        break;
      default:
        return;
    }

  if (request_lock)
    {
      btdm_in_wakeup_requesting_set(false);
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32_bt_controller_init
 *
 * Description:
 *    Init  BT controller.
 *
 * Input Parameters:
 *    None
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned
 *   on failure.
 *
 ****************************************************************************/

int esp32_bt_controller_init(void)
{
  esp_bt_controller_config_t cfg = BT_CONTROLLER_INIT_CONFIG_DEFAULT();
  uint32_t btdm_cfg_mask = 0;
  int err;
  int i;
  bool select_src_ret;
  bool set_div_ret;
#ifdef CONFIG_PM
  esp_timer_create_args_t create_args =
    {
      .callback = btdm_slp_tmr_callback,
      .arg = NULL,
      .name = "btSlp"
    };
#endif

  /* If all the bt available memory was already released,
   * cannot initialize bluetooth controller
   */

  if (g_btdm_dram_available_region[0].mode == ESP_BT_MODE_IDLE)
    {
      wlerr("Error, bt available memory was released\n");
      return -EIO;
    }

  g_ble_int_count = 0;

#ifdef CONFIG_ESPRESSIF_SPIFLASH

  /* Initialize interfaces that enable BLE ISRs to run during a
   * SPI flash operation.
   */

  if (esp_wireless_init() != OK)
    {
      return -EIO;
    }
#endif

