apache/nuttx/arch/xtensa/src/esp32/esp32_ble_adapter.c
#ifdef CONFIG_PM
  if (g_btdm_allow_light_sleep == false)
    {
      esp32_pm_lockacquire();
    }

  esp32_pm_lockacquire();
#endif

  esp_phy_enable(PHY_MODEM_BT);

#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  coex_enable();
#endif

  if (btdm_controller_get_sleep_mode() == BTDM_MODEM_SLEEP_MODE_ORIG)
    {
      btdm_controller_enable_sleep(true);
    }

  sdk_config_set_bt_pll_track_enable(true);

  /* initialize bluetooth baseband */

  btdm_check_and_init_bb();

  ret = btdm_controller_enable(mode);
  if (ret != 0)
    {
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
      coex_disable();
#endif
      esp_phy_disable(PHY_MODEM_BT);
#ifdef CONFIG_PM
      if (g_btdm_allow_light_sleep == false)
        {
          esp32_pm_lockrelease();
        }

      esp32_pm_lockrelease();
#endif
      return ERROR;
    }

  g_btdm_controller_status = ESP_BT_CONTROLLER_STATUS_ENABLED;

  return esp_wifi_to_errno(ret);
}

/****************************************************************************
 * Name: esp32_bt_controller_disable
 *
 * Description:
 *   Disable BT controller.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned
 *   on failure.
 *
 ****************************************************************************/

int esp32_bt_controller_disable(void)
{
  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED)
    {
      return ERROR;
    }

  /* disable modem sleep and wake up from sleep mode */

  if (btdm_controller_get_sleep_mode() == BTDM_MODEM_SLEEP_MODE_ORIG)
    {
      btdm_controller_enable_sleep(false);
      async_wakeup_request(BTDM_ASYNC_WAKEUP_REQ_CTRL_DISA);
      while (btdm_power_state_active() == false)
        {
          nxsched_usleep(1000);
        }
    }

  btdm_controller_disable();

#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  coex_disable();
#endif

  esp_phy_disable(PHY_MODEM_BT);
  g_btdm_controller_status = ESP_BT_CONTROLLER_STATUS_INITED;

#ifdef CONFIG_PM
  if (g_btdm_allow_light_sleep == false)
    {
      esp32_pm_lockrelease();
    }

  esp32_pm_lockrelease();
#endif

  return OK;
}

/****************************************************************************
 * Name: esp_bt_controller_get_status
 *
 * Description:
 *   Returns the status of the BT Controller
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The current status (type esp_bt_controller_status_t)
 *
 ****************************************************************************/

esp_bt_controller_status_t esp_bt_controller_get_status(void)
{
  return g_btdm_controller_status;
}

/****************************************************************************
 * Name: esp32_vhci_host_check_send_available
 *
 * Description:
 *   Check if the host can send packet to controller or not.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   bool - true or false
 *
 ****************************************************************************/

bool esp32_vhci_host_check_send_available(void)
{
  return api_vhci_host_check_send_available();
}

/****************************************************************************
 * Name: esp32_vhci_host_send_packet
 *
 * Description:
 *   Host send packet to controller.
 *
 * Input Parameters:
 *   data - the packet pointer
 *   len  - the packet length
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32_vhci_host_send_packet(uint8_t *data, uint16_t len)
{
  async_wakeup_request(BTDM_ASYNC_WAKEUP_REQ_HCI);

  api_vhci_host_send_packet(data, len);

  async_wakeup_request_end(BTDM_ASYNC_WAKEUP_REQ_HCI);
}

/****************************************************************************
 * Name: esp32_vhci_register_callback
 *
 * Description:
 *    Register the vhci reference callback.
 *
 * Input Parameters:
 *  callback - struct defined by vhci_host_callback structure.
 *
 * Returned Value:
 *   status - success or fail
 *
 ****************************************************************************/

int esp32_vhci_register_callback(const esp_vhci_host_callback_t *callback)
{
  int ret = ERROR;

  ret = api_vhci_host_register_callback(
            (const vhci_host_callback_t *)callback) == 0 ? 0 : -1;
  return ret;
}
